import requests
bebra = requests.get('https://pastebin.com/raw/MjhG1CgH')
text = """

  _                            _                        
 | |                          | |                       
 | |        ___     __ _    __| |   ___   _ __          
 | |       / _ \   / _` |  / _` |  / _ \ | '__|         
 | |____  | (_) | | (_| | | (_| | |  __/ | |            
 |______|  \___/   \__,_|  \__,_|  \___| |_|            
                                              ______ 
                                             |______|
"""
print(text)
print("""
[>]Привет! Я так подумал, что ты пиратишь... выбери действие
[-] 1 - Continiue free(бесплатно)
[-] 2 - Enter key(ключ)
"""
a = input(">>>:")

if a == '1':
      print("пошел нахуй ебырь")
      input()
if a == '2':
      pass
if a != '1' or '2':
      print("пошел нахуй ебырь")
      input()

key = input('Введи сюда ключ:')

try:
    if key in r.text:
        pass
    else:
        print("братиш ошибочка")
        input()
except:
    print('нетворк коннектид луз(')
print('''

  _          _           _     _                               
 | |        | |         | |   | |                              
 | |__   ___| |__   ___ | | __| | ___ _ __    __ _ _ __  _ __  
 | '_ \ / _ \ '_ \ / _ \| |/ _` |/ _ \ '__|  / _` | '_ \| '_ \ 
 | |_) |  __/ | | | (_) | | (_| |  __/ |    | (_| | |_) | |_) |
 |_.__/ \___|_| |_|\___/|_|\__,_|\___|_|     \__,_| .__/| .__/ 
                                                  | |   | |    
                                                  |_|   |_|    
                       
   _____ _  ______  _____   ____  
  / ____| |/ / __ \|  __ \ / __ \ 
 | |    | ' / |  | | |__) | |  | |
 | |    |  <| |  | |  ___/| |  | |
 | |____| . \ |__| | |    | |__| |
  \_____|_|\_\____/|_|     \____/ 
                                  
                                  

''')
input()
